app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("title", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?)  [["title", "Task trial"], ["created_at", "2021-10-12 11:33:22.261661"], ["updated_at", "2021-10-12 11:33:22.261661"], ["slug", "task-trial"]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "first task"], ["updated_at", "2021-10-12 11:28:19.791597"], ["id", 1]]

  def destroy
    if @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 4]]

    def load_task
      @task = Task.find_by(slug: params[:slug])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."slug" = ? LIMIT ?  [["slug", "task-trial"], ["LIMIT", 1]]