app/models/task.rb

SELECT "tasks".* FROM "tasks" WHERE (slug REGEXP 'learn-sql$|learn-sql-[0-9]+$') ORDER BY "tasks"."slug" DESC LIMIT ?  [["LIMIT", 1]]
---
    def set_slug
      title_slug = title.parameterize
      regex_pattern = "slug #{Constants::DB_REGEX_OPERATOR} ?"
      latest_task_slug = Task.where(
        regex_pattern,
        "#{title_slug}$|#{title_slug}-[0-9]+$"
      ).order(slug: :desc).first&.slug